Revit 2027 API
RebarBendingDetail.SetHost Method
 Sets the reinforcement element that will be represented by the input bending detail.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetHost(
	Element bendingDetail,
	Reference reference
)
Public Shared Sub SetHost (
	bendingDetail As Element,
	reference As Reference
)
public:
static void SetHost(
	Element^ bendingDetail,
	Reference^ reference
)
static member SetHost :
        bendingDetail : Element *
        reference : Reference -> unit
Parameters
bendingDetail Element
 The bending detail for which we want to set the host.
reference Reference
 Reference pointing to the reinforcement element that will be represented by the input bending detail.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace